Ran Plan for dir: `terraform/environments/production` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.network.data.aws_availability_zones.available: Reading...
module.network.data.aws_availability_zones.available: Read complete after 2s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.application.aws_ecr_repository.flask_app[0] will be created
+ resource "aws_ecr_repository" "flask_app" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "flask-app"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-ecr-flask-app"
          + "Project"     = "test-update-atlantis"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-ecr-flask-app"
          + "Project"     = "test-update-atlantis"
        }
    }

  # module.application.aws_ecr_repository.redis[0] will be created
+ resource "aws_ecr_repository" "redis" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "redis"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-ecr-redis"
          + "Project"     = "test-update-atlantis"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-ecr-redis"
          + "Project"     = "test-update-atlantis"
        }
    }

  # module.application.aws_ecs_cluster.main[0] will be created
+ resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "production-test-update-atlantis-web-visitor-counter"
      + tags     = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-web-visitor-counter"
          + "Project"     = "test-update-atlantis"
        }
      + tags_all = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-web-visitor-counter"
          + "Project"     = "test-update-atlantis"
        }
    }

  # module.application.aws_security_group.ecs will be created
+ resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "production-test-update-atlantis-web-visitor-counter-sg"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "production-test-update-atlantis-web-visitor-counter-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-web-visitor-counter-sg"
          + "Project"     = "test-update-atlantis"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-web-visitor-counter-sg"
          + "Project"     = "test-update-atlantis"
        }
      + vpc_id                 = (known after apply)
    }

  # module.network.aws_internet_gateway.igw will be created
+ resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-igw"
          + "Project"     = "test-update-atlantis"
        }
      + tags_all = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-igw"
          + "Project"     = "test-update-atlantis"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.aws_route.public-route-to-igw will be created
+ resource "aws_route" "public-route-to-igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.network.aws_route_table.private will be created
+ resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-route-table-private"
          + "Project"     = "test-update-atlantis"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-route-table-private"
          + "Project"     = "test-update-atlantis"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.public will be created
+ resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-route-table-public"
          + "Project"     = "test-update-atlantis"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-route-table-public"
          + "Project"     = "test-update-atlantis"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table_association.private[0] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private[1] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public[0] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public[1] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_subnet.private[0] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-private-subnet-1"
          + "Project"     = "test-update-atlantis"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-private-subnet-1"
          + "Project"     = "test-update-atlantis"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private[1] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-private-subnet-2"
          + "Project"     = "test-update-atlantis"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-private-subnet-2"
          + "Project"     = "test-update-atlantis"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public[0] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-public-subnet-1"
          + "Project"     = "test-update-atlantis"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-public-subnet-1"
          + "Project"     = "test-update-atlantis"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public[1] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-public-subnet-2"
          + "Project"     = "test-update-atlantis"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-public-subnet-2"
          + "Project"     = "test-update-atlantis"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_vpc.main will be created
+ resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-vpc"
          + "Project"     = "test-update-atlantis"
        }
      + tags_all                             = {
          + "Environment" = "production"
          + "Name"        = "production-test-update-atlantis-vpc"
          + "Project"     = "test-update-atlantis"
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.network.aws_eip.natgw,
│   on ../../modules/network/natgw.tf line 17, in resource "aws_eip" "natgw":
│   17:   vpc   = true
│ 
│ use domain attribute instead
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/environments/production`
* :put_litter_in_its_place: To **delete** this plan click [here](https://a6d3-2404-e801-2014-106d-ed73-99a5-8e1-dce6.ap.ngrok.io/lock?id=biancadenise12%252Fweb-visitor-counter%252Fterraform%252Fenvironments%252Fproduction%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/environments/production`
</details>
Plan: 17 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`